class script(object):
    START_TXT = """<b>🎬 Wᴇʟᴄᴏᴍᴇ ᴛᴏ CɪɴᴇᴍᴀHᴜʙ! 🎬</b>

<b>ʜᴇʏ {}, {}</b>

<b>🤖 ɪ ᴀᴍ <a href=https://t.me/{}>{}</a>, ᴛʜᴇ ᴍᴏꜱᴛ ᴘᴏᴡᴇʀꜰᴜʟ ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ʙᴏᴛ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇꜱ.</b>
"""


    GSTART_TXT = """<b>🎬 Wᴇʟᴄᴏᴍᴇ ᴛᴏ CɪɴᴇᴍᴀHᴜʙ! 🎬</b>

<b>ʜᴇʏ {},</b>

<b>🤖 ɪ ᴀᴍ <a href=https://t.me/{}>{}</a>, ᴛʜᴇ ᴍᴏꜱᴛ ᴘᴏᴡᴇʀꜰᴜʟ ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ ʙᴏᴛ ᴡɪᴛʜ ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇꜱ.</b>"""

    LOG_TEXT_G = """<b>#NewGroup
    
🤖 ʙᴏᴛ ᴀᴅᴅᴇᴅ ᴛᴏ ᴀ ɴᴇᴡ ɢʀᴏᴜᴘ 🤖

‣ ɢʀᴏᴜᴘ ɴᴀᴍᴇ: <code>{}</code>
‣ ɢʀᴏᴜᴘ ɪᴅ: <code>{}</code>
‣ ᴍᴇᴍʙᴇʀꜱ: <code>{}</code>
‣ ᴀᴅᴅᴇᴅ ʙʏ: {}</b>"""

    LOG_TEXT_G_READD = """<b>#ReAddedToGroup
    
🔄 ʙᴏᴛ ʀᴇ-ᴀᴅᴅᴇᴅ ᴛᴏ ɢʀᴏᴜᴘ 🔄

‣ ɢʀᴏᴜᴘ ɴᴀᴍᴇ: <code>{}</code>
‣ ɢʀᴏᴜᴘ ɪᴅ: <code>{}</code>
‣ ᴍᴇᴍʙᴇʀꜱ: <code>{}</code>
‣ ᴀᴅᴅᴇᴅ ʙʏ: {}</b>"""

    LOG_TEXT_REMOVE_G = """<b>#RemovedFromGroup
    
⛔ ʙᴏᴛ ʀᴇᴍᴏᴠᴇᴅ / ᴋɪᴄᴋᴇᴅ ꜰʀᴏᴍ ɢʀᴏᴜᴘ ⛔

‣ ɢʀᴏᴜᴘ ɴᴀᴍᴇ: <code>{}</code>
‣ ɢʀᴏᴜᴘ ɪᴅ: <code>{}</code>
‣ ʀᴇᴍᴏᴠᴇᴅ ʙʏ: {}</b>"""

    LOG_TEXT_C = """<b>#NewChannel
    
🤖 ʙᴏᴛ ᴀᴅᴅᴇᴅ ᴛᴏ ᴀ ɴᴇᴡ ᴄʜᴀɴɴᴇʟ 🤖

‣ ᴄʜᴀɴɴᴇʟ ɴᴀᴍᴇ: <code>{}</code>
‣ ᴄʜᴀɴɴᴇʟ ɪᴅ: <code>{}</code>
‣ ᴍᴇᴍʙᴇʀꜱ: <code>{}</code>
‣ ᴀᴅᴅᴇᴅ ʙʏ: {}</b>"""

    LOG_TEXT_REMOVE_C = """<b>#RemovedFromChannel
    
⛔ ʙᴏᴛ ʀᴇᴍᴏᴠᴇᴅ ꜰʀᴏᴍ ᴄʜᴀɴɴᴇʟ ⛔

‣ ᴄʜᴀɴɴᴇʟ ɴᴀᴍᴇ: <code>{}</code>
‣ ᴄʜᴀɴɴᴇʟ ɪᴅ: <code>{}</code>
‣ ʀᴇᴍᴏᴠᴇᴅ ʙʏ: {}</b>"""

    HELP_TXT = """<b>
    
✨ ʜᴏᴡ ᴛᴏ ʀᴇǫᴜᴇꜱᴛ ᴅʀᴀᴍᴀꜱ & ᴍᴏᴠɪᴇꜱ ✨  

1️⃣ ꜱᴇᴀʀᴄʜ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ ɴᴀᴍᴇ ᴏɴ ɢᴏᴏɢʟᴇ.  
2️⃣ ꜱᴇɴᴅ ᴛʜᴇ ɴᴀᴍᴇ ɪɴ ᴛʜᴇ ɢʀᴏᴜᴘ.  
3️⃣ ᴜꜱᴇ ᴛʜɪꜱ ꜰᴏʀᴍᴀᴛ:  

📌 ꜰᴏʀ ꜱᴇʀɪᴇꜱ:  
➤ ᴅʀᴀᴍᴀ ɴᴀᴍᴇ + S01 (ꜰᴏʀ ꜱᴇᴀꜱᴏɴ 1, ᴄʜᴀɴɢᴇ ꜰᴏʀ ᴏᴛʜᴇʀꜱ)  

📌 ꜰᴏʀ ʜɪɴᴅɪ ᴅʀᴀᴍᴀꜱ:  
➤ ᴅʀᴀᴍᴀ ɴᴀᴍᴇ + ʜɪɴᴅɪ  

📌 ꜰᴏʀ ᴍᴏᴠɪᴇꜱ:  
➤ ᴍᴏᴠɪᴇ ɴᴀᴍᴇ + ʏᴇᴀʀ (ᴇx: ᴊᴏᴋᴇʀ 2019)  

🚀 ꜰᴏʟʟᴏᴡ ᴛʜᴇꜱᴇ ꜱᴛᴇᴘꜱ!
</b>"""

    ABOUT_TXT = """<b>╭────[ ᴍʏ ᴅᴇᴛᴀɪʟs ]────⍟
├⍟ Mʏ Nᴀᴍᴇ : <a href=https://t.me/{0}>{1}</a>
├⍟ Dᴇᴠᴇʟᴏᴘᴇʀ : <a href='https://t.me/rolexsir_8'>Rolex Sir</a> 
├⍟ Lɪʙʀᴀʀʏ : <a href='https://docs.pyrogram.org/'>ᴘʏʀᴏɢʀᴀᴍ</a>
├⍟ Lᴀɴɢᴜᴀɢᴇ : <a href='https://www.python.org/download/releases/3.0/'>ᴘʏᴛʜᴏɴ 𝟹</a> 
├⍟ Bᴜɪʟᴅ Sᴛᴀᴛᴜs : ᴠ2.0 [ ꜱᴛᴀʙʟᴇ ]
╰───────────────⍟</b>

⚠️ <b>Dɪsᴄʟᴀɪᴍᴇʀ :</b> <i>I do not host any content. All files are indexed from 3rd party sources over the internet. I merely act as a search interface. Any DMCA/legal issues should be directed to the respective content hosters!</i>"""
    RESTART_TXT = """
<b>{} Bᴏᴛ Rᴇsᴛᴀʀᴛᴇᴅ !

📅 Dᴀᴛᴇ : <code>{}</code>
⏰ Tɪᴍᴇ : <code>{}</code>
🌐 Tɪᴍᴇᴢᴏɴᴇ : <code>Asia/Kolkata</code>
🛠️ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: <code> v1.4 [ Sᴛᴀʙʟᴇ ]</code>
</b>"""

    CHANNELS = """
<b>⚡ ɢʀᴏᴜᴘs & ᴄʜᴀɴɴᴇʟs ɪɴғᴏ ⚡ 

▫ ᴀʟʟ ɴᴇᴡ ᴍᴏᴠɪᴇs & sᴇʀɪᴇs.
▫ ғᴀsᴛᴇsᴛ ʙᴏᴛs ᴀʀᴇ ᴀᴅᴅᴇᴅ.
▫ ғʀᴇᴇ & ᴇᴀsʏ ᴛᴏ ᴜsᴇ.
▫ 𝟸𝟺x𝟽 sᴇʀᴠɪᴄᴇs ᴀᴠᴀɪʟᴀʙʟᴇ.</b>"""

    MULTI_STATUS_TXT = """<b>╭────[ 🗃 ᴅᴀᴛᴀʙᴀsᴇ 1 🗃] ────⍟</b>
│
├⋟ ᴀʟʟ ᴜsᴇʀs ⋟ <code>{}</code>
├⋟ ᴀʟʟ ɢʀᴏᴜᴘs ⋟ <code>{}</code>
├⋟ ᴘʀᴇᴍɪᴜᴍ ᴜꜱᴇʀꜱ ⋟ <code>{}</code>
├⋟ ᴀʟʟ ꜰɪʟᴇs ⋟ <code>{}</code>
├⋟ ᴜsᴇᴅ sᴛᴏʀᴀɢᴇ ⋟ <code>{}</code>
├⋟ ꜰʀᴇᴇ sᴛᴏʀᴀɢᴇ ⋟ <code>{}</code>
│
<b>├────[ 🗳 ᴅᴀᴛᴀʙᴀsᴇ 2 🗳 ]────⍟</b>   
│
├⋟ ᴀʟʟ ꜰɪʟᴇs ⋟ <code>{}</code>
├⋟ ꜱɪᴢᴇ ⋟ <code>{}</code>
├⋟ ꜰʀᴇᴇ ⋟ <code>{}</code>
│
<b>├────[ 🤖 ʙᴏᴛ ᴅᴇᴛᴀɪʟs 🤖 ]────⍟</b>   
│
├⋟ ᴜᴘᴛɪᴍᴇ ⋟ {}
├⋟ ʀᴀᴍ ⋟ <code>{}%</code>
├⋟ ᴄᴘᴜ ⋟ <code>{}%</code>   
│
├⋟ ʙᴏᴛʜ ᴅʙ ꜰɪʟᴇ'ꜱ: <code>{}</code>
│
<b>╰─────────────────────⍟</b>"""

    STATUS_TXT = """<b>╔══[ 🏆 ᴄɪɴᴇᴍᴀʜᴜʙ ʙᴏᴛ — ꜱᴛᴀᴛꜱ ]══⍟</b>
│
<b>├──[ 👥 ᴜꜱᴇʀ & ɢʀᴏᴜᴘ ᴅᴀᴛᴀ ]</b>
├⋟ ᴛᴏᴛᴀʟ ᴜꜱᴇʀꜱ  ‣  <code>{}</code>
├⋟ ᴛᴏᴛᴀʟ ɢʀᴏᴜᴘꜱ  ‣  <code>{}</code>
├⋟ ᴘʀᴇᴍɪᴜᴍ ᴜꜱᴇʀꜱ  ‣  <code>{}</code>
├⋟ ʙᴀɴɴᴇᴅ ᴜꜱᴇʀꜱ  ‣  <code>{}</code>
├⋟ ʙᴀɴɴᴇᴅ ɢʀᴏᴜᴘꜱ  ‣  <code>{}</code>
│
<b>├──[ 🗃 ᴅᴀᴛᴀʙᴀꜱᴇ ɪɴꜰᴏ ]</b>
├⋟ ᴛᴏᴛᴀʟ ꜰɪʟᴇꜱ  ‣  <code>{}</code>
├⋟ ᴅʙ ᴜꜱᴇᴅ  ‣  <code>{}</code>
├⋟ ᴅʙ ꜰʀᴇᴇ  ‣  <code>{}</code>
├⋟ ᴅʙ ᴜꜱᴀɢᴇ  ‣  <code>{}%</code>
│
<b>├──[ 🖥️ ꜱʏꜱᴛᴇᴍ ɪɴꜰᴏ ]</b>
├⋟ ʙᴏᴛ ᴜᴘᴛɪᴍᴇ  ‣  <code>{}</code>
├⋟ ʀᴀᴍ ᴜꜱᴀɢᴇ  ‣  <code>{}%</code>
├⋟ ᴄᴘᴜ ᴜꜱᴀɢᴇ  ‣  <code>{}%</code>
├⋟ ᴅɪꜱᴋ ᴜꜱᴇᴅ  ‣  <code>{}</code>
├⋟ ᴅɪꜱᴋ ᴛᴏᴛᴀʟ  ‣  <code>{}</code>
│
<b>╚═══════════════════════⍟</b>"""

    LOG_TEXT_G = """#NewGroup
    
Gʀᴏᴜᴘ = {}
Iᴅ = <code>{}</code>
Tᴏᴛᴀʟ Mᴇᴍʙᴇʀs = <code>{}</code>
Aᴅᴅᴇᴅ Bʏ - {}
"""

    LOG_TEXT_P = """#NewUser
    
Iᴅ - <code>{}</code>
Nᴀᴍᴇ - {}
"""
    NT_ADMIN_ALRT_TXT = """‼️ ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴀᴅᴍɪɴ ɪɴ ᴛʜɪꜱ ɢʀᴏᴜᴘ ‼️"""

    NT_ALRT_TXT = """Not Yours!"""
    
    ALRT_TXT = """ʜᴇʟʟᴏ {},
ᴛʜɪꜱ ɪꜱ ɴᴏᴛ ʏᴏᴜʀ ᴍᴏᴠɪᴇ ʀᴇǫᴜᴇꜱᴛ,
ʀᴇǫᴜᴇꜱᴛ ʏᴏᴜʀ'ꜱ..."""

    OLD_ALRT_TXT = """ʜᴇʏ {},
ʏᴏᴜ ᴀʀᴇ ᴜꜱɪɴɢ ᴏɴᴇ ᴏꜰ ᴍʏ ᴏʟᴅ ᴍᴇꜱꜱᴀɢᴇꜱ, 
ᴘʟᴇᴀꜱᴇ ꜱᴇɴᴅ ᴛʜᴇ ʀᴇǫᴜᴇꜱᴛ ᴀɢᴀɪɴ."""

    PRE_STREAM = """🔒 ᴛʜɪs ꜰᴇᴀᴛᴜʀᴇ ɪs ᴏɴʟʏ ꜰᴏʀ 🏅 ᴘʀᴇᴍɪᴜᴍ ᴜsᴇʀs

✨ ᴜɴʟᴏᴄᴋ ᴇxᴄʟᴜsɪᴠᴇ ᴄᴏɴᴛᴇɴᴛ ᴀɴᴅ ꜰᴇᴀᴛᴜʀᴇs  
💳 ʙᴜʏ ᴘʀᴇᴍɪᴜᴍ ᴛᴏ ɢᴇᴛ sᴛᴀʀᴛᴇᴅ"""

    PRE_STREAM_ALERT = """⚠️ ᴘʀᴇᴍɪᴜᴍ ᴄᴏɴᴛᴇɴᴛ ❗  
🔓 ᴜɴʟᴏᴄᴋ ɪᴛ ʙʏ ᴜᴘɢʀᴀᴅɪɴɢ ᴛᴏ ᴘʀᴇᴍɪᴜᴍ"""

    CUDNT_FND = SPELLING_ERROR_TXT = """<b>‼️ ꜱᴘᴇʟʟɪɴɢ ᴍɪꜱᴛᴀᴋᴇ ʙʀᴏ!</b>  
<b>😊 ɴᴏ ᴡᴏʀʀɪᴇꜱ — ᴄʜᴏᴏꜱᴇ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ ᴏɴᴇ ʙᴇʟᴏᴡ 👇</b>

<blockquote>👇 नीचे दिए गए विकल्पों में से movie के नाम की सही spelling चुनें</blockquote>"""


    DEL_MSG = """⚠️ ᴛʜɪꜱ ᴍᴏᴠɪᴇ ꜰɪʟᴇ/ᴠɪᴅᴇᴏ ᴡɪʟʟ ʙᴇ ᴅᴇʟᴇᴛᴇᴅ ɪɴ <b><u><code>{}</code></u></b>

<blockquote expandable><b><i>ᴘʟᴇᴀꜱᴇ ꜰᴏʀᴡᴀʀᴅ ᴛʜɪꜱ ꜰɪʟᴇ ᴛᴏ ꜱᴏᴍᴇᴡʜᴇʀᴇ ᴇʟꜱᴇ & ꜱᴛᴀʀᴛ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ᴛʜᴇʀᴇ</i></b></blockquote>"""





    I_CUDNT = """<b>sᴏʀʀʏ ɴᴏ ꜰɪʟᴇs ᴡᴇʀᴇ ꜰᴏᴜɴᴅ ꜰᴏʀ ʏᴏᴜʀ ʀᴇǫᴜᴇꜱᴛ {} 😕

ᴄʜᴇᴄᴋ ʏᴏᴜʀ sᴘᴇʟʟɪɴɢ ɪɴ ɢᴏᴏɢʟᴇ ᴀɴᴅ ᴛʀʏ ᴀɢᴀɪɴ 😃

📝 ᴍᴏᴠɪᴇ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴍᴀᴛ 👇

⚜️ ᴇxᴀᴍᴘʟᴇ : Jawan or Jawan 2023 

📝 ꜱᴇʀɪᴇꜱ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴍᴀᴛ 👇

⚜️ ᴇxᴀᴍᴘʟᴇ : Loki S01 or Loki S01E04 or Lucifer S03E24

🚯 ᴅᴏɴᴛ ᴜꜱᴇ ➠ ':(!,./)</b>"""
    
    I_CUD_NT = """<b>ɪ ᴄᴏᴜʟᴅɴ'ᴛ ꜰɪɴᴅ ᴀɴʏ ᴍᴏᴠɪᴇ ʀᴇʟᴀᴛᴇᴅ ᴛᴏ {}.

ᴍᴏᴠɪᴇ ɴᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ʀᴇᴀsᴏɴ :

1) ᴏ.ᴛ.ᴛ ᴏʀ ᴅᴠᴅ ɴᴏᴛ ʀᴇʟᴇᴀsᴇᴅ

2) ᴛʏᴘᴇ ɴᴀᴍᴇ ᴡɪᴛʜ ʏᴇᴀʀ

3) ᴍᴏᴠɪᴇ ɪs ɴᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ɪɴ ᴛʜᴇ ᴅᴀᴛᴀʙᴀsᴇ ʀᴇᴘᴏʀᴛ ᴛᴏ ᴀᴅᴍɪɴs</b>"""

    MVE_NT_FND = NOT_FOUND_TXT = """<b>😌 ᴛʜɪꜱ ᴍᴏᴠɪᴇ ɪꜱ ɴᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ɪɴ ᴍʏ ᴅᴀᴛᴀʙᴀꜱᴇ.</b>

<blockquote>😌 यह ᴍᴏᴠɪᴇ मुझे ᴍᴇʀᴇ ᴅᴀᴛᴀʙᴀꜱᴇ में नहीं मिली।</blockquote>"""

    
    TOP_ALRT_MSG = """ꜱᴇᴀʀᴄʜɪɴɢ ꜰᴏʀ ǫᴜᴇʀʏ ɪɴ ᴍʏ ᴅᴀᴛᴀʙᴀꜱᴇ..."""

    MELCOW_ENG = """<b>👋 ʜᴇʏ {},\n\n🍁 ᴡᴇʟᴄᴏᴍᴇ ᴛᴏ\n🌟 {} \n\n🔍 ʜᴇʀᴇ ʏᴏᴜ ᴄᴀɴ ꜱᴇᴀʀᴄʜ ʏᴏᴜʀ ꜰᴀᴠᴏᴜʀɪᴛᴇ ᴍᴏᴠɪᴇꜱ ᴏʀ ꜱᴇʀɪᴇꜱ ʙʏ ᴊᴜꜱᴛ ᴛʏᴘɪɴɢ ɪᴛ'ꜱ ɴᴀᴍᴇ 🔎\n\n⚠️ ɪꜰ ʏᴏᴜ'ʀᴇ ʜᴀᴠɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʀᴇɢᴀʀᴅɪɴɢ ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ᴏʀ ꜱᴏᴍᴇᴛʜɪɴɢ ᴇʟꜱᴇ ᴛʜᴇɴ ᴍᴇꜱꜱᴀɢᴇ ʜᴇʀᴇ 👇</b>"""
    
    DISCLAIMER_TXT = """
<b>ᴛʜɪꜱ ɪꜱ ᴀɴ ᴏᴘᴇɴ ꜱᴏᴜʀᴄᴇ ᴘʀᴏᴊᴇᴄᴛ.

ᴀʟʟ ᴛʜᴇ ꜰɪʟᴇꜱ ɪɴ ᴛʜɪꜱ ʙᴏᴛ ᴀʀᴇ ꜰʀᴇᴇʟʏ ᴀᴠᴀɪʟᴀʙʟᴇ ᴏɴ ᴛʜᴇ ɪɴᴛᴇʀɴᴇᴛ ᴏʀ ᴘᴏꜱᴛᴇᴅ ʙʏ ꜱᴏᴍᴇʙᴏᴅʏ ᴇʟꜱᴇ. ᴊᴜꜱᴛ ꜰᴏʀ ᴇᴀꜱʏ ꜱᴇᴀʀᴄʜɪɴɢ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ɪɴᴅᴇxɪɴɢ ꜰɪʟᴇꜱ ᴡʜɪᴄʜ ᴀʀᴇ ᴀʟʀᴇᴀᴅʏ ᴜᴘʟᴏᴀᴅᴇᴅ ᴏɴ ᴛᴇʟᴇɢʀᴀᴍ. ᴡᴇ ʀᴇꜱᴘᴇᴄᴛ ᴀʟʟ ᴛʜᴇ ᴄᴏᴘʏʀɪɢʜᴛ ʟᴀᴡꜱ ᴀɴᴅ ᴡᴏʀᴋꜱ ɪɴ ᴄᴏᴍᴘʟɪᴀɴᴄᴇ ᴡɪᴛʜ ᴅᴍᴄᴀ ᴀɴᴅ ᴇᴜᴄᴅ. ɪꜰ ᴀɴʏᴛʜɪɴɢ ɪꜱ ᴀɢᴀɪɴꜱᴛ ʟᴀᴡ ᴘʟᴇᴀꜱᴇ ᴄᴏɴᴛᴀᴄᴛ ᴍᴇ ꜱᴏ ᴛʜᴀᴛ ɪᴛ ᴄᴀɴ ʙᴇ ʀᴇᴍᴏᴠᴇᴅ ᴀꜱᴀᴘ. ɪᴛ ɪꜱ ꜰᴏʀʙɪʙʙᴇɴ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ, ꜱᴛʀᴇᴀᴍ, ʀᴇᴘʀᴏᴅᴜᴄᴇ, ꜱʜᴀʀᴇ ᴏʀ ᴄᴏɴꜱᴜᴍᴇ ᴄᴏɴᴛᴇɴᴛ ᴡɪᴛʜᴏᴜᴛ ᴇxᴘʟɪᴄɪᴛ ᴘᴇʀᴍɪꜱꜱɪᴏɴ ꜰʀᴏᴍ ᴛʜᴇ ᴄᴏɴᴛᴇɴᴛ ᴄʀᴇᴀᴛᴏʀ ᴏʀ ʟᴇɢᴀʟ ᴄᴏᴘʏʀɪɢʜᴛ ʜᴏʟᴅᴇʀ. ɪꜰ ʏᴏᴜ ʙᴇʟɪᴇᴠᴇ ᴛʜɪꜱ ʙᴏᴛ ɪꜱ ᴠɪᴏʟᴀᴛɪɴɢ ʏᴏᴜʀ ɪɴᴛᴇʟʟᴇᴄᴛᴜᴀʟ ᴘʀᴏᴘᴇʀᴛʏ, ᴄᴏɴᴛᴀᴄᴛ ᴛʜᴇ ʀᴇꜱᴘᴇᴄᴛɪᴠᴇ ᴄʜᴀɴɴᴇʟꜱ ꜰᴏʀ ʀᴇᴍᴏᴠᴀʟ. ᴛʜᴇ ʙᴏᴛ ᴅᴏᴇꜱ ɴᴏᴛ ᴏᴡɴ ᴀɴʏ ᴏꜰ ᴛʜᴇꜱᴇ ᴄᴏɴᴛᴇɴᴛꜱ, ɪᴛ ᴏɴʟʏ ɪɴᴅᴇx ᴛʜᴇ ꜰɪʟᴇꜱ ꜰʀᴏᴍ ᴛᴇʟᴇɢʀᴀᴍ. 
</b>"""

    DREAMXBOTZ_DONATION = DONATE_TXT = """<b>👋 ʜᴇʏ {},</b>

<blockquote>💖 <b>ᴘʟᴇᴀꜱᴇ ᴅᴏɴᴀᴛᴇ ᴛᴏ ᴛʜᴇ ᴅᴇᴠᴇʟᴏᴘᴇʀ</b></blockquote>

<b>🔧 ᴛᴏ ᴋᴇᴇᴘ ᴛʜɪꜱ ꜱᴇʀᴠɪᴄᴇ ᴀʟɪᴠᴇ, ᴀᴅᴅ ɴᴇᴡ ꜰᴇᴀᴛᴜʀᴇꜱ & ᴜᴘʟᴏᴀᴅ ʙᴇꜱᴛ ᴍᴏᴠɪᴇꜱ/ᴡᴇʙꜱᴇʀɪᴇꜱ ɴᴏɴ-ꜱᴛᴏᴘ ɪɴ ʜɪɢʜ Qᴜᴀʟɪᴛʏ, ᴡᴇ ɴᴇᴇᴅ ʏᴏᴜʀ ꜱᴜᴘᴘᴏʀᴛ.
ɪᴛ ʜᴇʟᴘꜱ ᴜꜱ ᴘᴀʏ ꜰᴏʀ ʜᴇʀᴏᴋᴜ & ꜱᴇʀᴠᴇʀ ʀᴇꜱᴏᴜʀᴄᴇꜱ.</b>

<b>🌝 ʏᴏᴜ ᴄᴀɴ ᴅᴏɴᴀᴛᴇ ᴀɴʏ ᴀᴍᴏᴜɴᴛ ʏᴏᴜ ʜᴀᴠᴇ.</b>

<blockquote>🎉 <b>ꜱᴇʟᴇᴄᴛ ʏᴏᴜʀ ᴅᴏɴᴀᴛɪᴏɴ ᴍᴇᴛʜᴏᴅ 👇</b></blockquote>

➤ 📷 Qʀ ᴄᴏᴅᴇ → <a href='{}'>ᴄʟɪᴄᴋ ʜᴇʀᴇ ᴛᴏ ꜱᴄᴀɴ</a>  
➤ 💸 ᴜᴘɪ ɪᴅ → <code>{}</code>

‼️ <b>ᴍᴜꜱᴛ ꜱᴇɴᴅ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀꜰᴛᴇʀ ᴅᴏɴᴀᴛɪɴɢ.</b>"""


    SINFO = """
⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯
ꜱᴇʀɪᴇꜱ ʀᴇǫᴜᴇꜱᴛ ꜰᴏʀᴍᴀᴛ
⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯⋯

ɢᴏ ᴛᴏ ɢᴏᴏɢʟᴇ ➠ ᴛʏᴘᴇ ꜱᴇʀɪᴇꜱ ɴᴀᴍᴇ ➠ ᴄᴏᴘʏ ᴄᴏʀʀᴇᴄᴛ ɴᴀᴍᴇ ➠ ᴘᴀꜱᴛᴇ ᴛʜɪꜱ ɢʀᴏᴜᴘ

ᴇxᴀᴍᴘʟᴇ : Loki S01E01

🚯 ᴅᴏɴᴛ ᴜꜱᴇ ➠ ':(!,./)"""

    NORSLTS = """ 
#NoResults

Iᴅ : <code>{}</code>
Nᴀᴍᴇ : {}

Mᴇꜱꜱᴀɢᴇ : <b>{}</b>"""
    
    CAPTION = """<b><a href="https://t.me/Univora_CinemahubBot">{file_name}</a></b>\n\n<b>⚜️ Powered By : <a href="https://univora.site">[ Univora ]</a></b>"""

    
    MOVIE_UPDATE_NOTIFY_TXT = """
</b><a href={poster_url}>📥</a><a href={imdb_url}>New {tag} Added</a></b>

<blockquote>✨ ᴛɪᴛʟᴇ : <code>{filename}</code>


🎭 ɢᴇɴʀᴇs : <b>{genres}</b>
📺 ᴏᴛᴛ        : <b>{ott}</b>
🎞️ ǫᴜᴀʟɪᴛʏ : <b>{quality}</b>
🎧 ᴀᴜᴅɪᴏ    : <b>{language}</b>
🔥 ʀᴀᴛɪɴɢ   : <b>{rating}</b>
{episodes}
</blockquote>


🔍 <b>Sᴇᴀʀᴄʜ →</b> {search_link}
"""


    IMDB_TEMPLATE_TXT = """<b><a href={url}>{title} (<a href={url}/releaseinfo>{year}</a>)

ʀᴀᴛɪɴɢ : <a href={url}/ratings>{rating}</a>
ɢᴇɴʀᴇ : {genres}
ᴀᴜᴅɪᴏ : {languages}

sʜᴏᴡɴ ɪɴ : {remaining_seconds} <i>sᴇᴄ</i>⚡️
<b>ʀᴇǫ ʙʏ : {message.from_user.mention}</b>"""

    LOGO = r"""
   ██████╗██╗███╗   ██╗███████╗███╗   ███╗ █████╗ ██╗  ██╗██╗   ██╗██████╗ 
  ██╔════╝██║████╗  ██║██╔════╝████╗ ████║██╔══██╗██║  ██║██║   ██║██╔══██╗
  ██║     ██║██╔██╗ ██║█████╗  ██╔████╔██║███████║███████║██║   ██║██████╔╝
  ██║     ██║██║╚██╗██║██╔══╝  ██║╚██╔╝██║██╔══██║██╔══██║██║   ██║██╔══██╗
  ╚██████╗██║██║ ╚████║███████╗██║ ╚═╝ ██║██║  ██║██║  ██║╚██████╔╝██████╔╝
   ╚═════╝╚═╝╚═╝  ╚═══╝╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═════╝

    🎬  C I N E M A H U B  B O T  —  R U N N I N G  ✅
    """


    #PLANS

    PAGE_TXT = """ᴡʜʏ ᴀʀᴇ ʏᴏᴜ ꜱᴏ ᴄᴜʀɪᴏᴜꜱ ⁉️"""

    PURCHASE_TXT = """ꜱᴇʟᴇᴄᴛ ʏᴏᴜʀ ᴘᴀʏᴍᴇɴᴛ ᴍᴇᴛʜᴏᴅ."""

    

    PREMIUM_TEXT = """<blockquote>🎖️ <b>ᴀᴠᴀɪʟᴀʙʟᴇ ᴘʟᴀɴꜱ</b></blockquote>


◉ 07 ᴅᴀʏꜱ  -  ₹20   / 20 ꜱᴛᴀʀ
◉ 15 ᴅᴀʏꜱ  -  ₹40   / 40 ꜱᴛᴀʀ
◉ 30 ᴅᴀʏꜱ  -  ₹80   / 80 ꜱᴛᴀʀ
◉ 45 ᴅᴀʏꜱ  -  ₹110  / 110 ꜱᴛᴀʀ
◉ 60 ᴅᴀʏꜱ  -  ₹130  / 130 ꜱᴛᴀʀ
◉ ʟɪꜰᴇᴛɪᴍᴇ  -  ₹1500

•─────•─────────•─────•
🏷️ <a href='https://t.me/rolexsir_8'>ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ ᴘʀᴏᴏꜰ</a>

‼️ ᴍᴜꜱᴛ ꜱᴇɴᴅ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.
‼️ ᴀꜰᴛᴇʀ ꜱᴇɴᴅɪɴɢ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ɢɪᴠᴇ ᴜꜱ ꜱᴏᴍᴇᴛɪᴍᴇꜱ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴘʀᴇᴍɪᴜᴍ ʟɪꜱᴛ."""

    PREMIUM_STAR_TEXT = """<b><blockquote>ᴘᴀʏᴍᴇɴᴛ ᴍᴇᴛʜᴏᴅ: ᴛᴇʟᴇɢʀᴀᴍ ꜱᴛᴀʀꜱ ⭐</blockquote>

ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ʙᴜʏ ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ꜱᴇʀᴠɪᴄᴇ ᴜꜱɪɴɢ ᴛᴇʟᴇɢʀᴀᴍ ꜱᴛᴀʀꜱ.  

ɪꜰ ʏᴏᴜ ꜰᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ, ᴛᴀᴋᴇ ᴀ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀɴᴅ ꜱᴇɴᴅ ɪᴛ ᴛᴏ - @rolexsir_8

ꜱᴇʟᴇᴄᴛ ʏᴏᴜʀ ᴅᴇꜱɪʀᴇᴅ ᴀᴍᴏᴜɴᴛ ᴀɴᴅ ᴘᴜʀᴄʜᴀꜱᴇ ᴀ ꜱᴜʙꜱᴄʀɪᴘᴛɪᴏɴ 👇.</b>
"""

    PREMIUM_UPI_TEXT = """<b><blockquote>ᴘᴀʏᴍᴇɴᴛ ᴍᴇᴛʜᴏᴅ: ᴜᴘɪ</blockquote>

ʏᴏᴜ ᴄᴀɴ ᴘᴜʀᴄʜᴀꜱᴇ ᴘʀᴇᴍɪᴜᴍ ᴛʜʀᴏᴜɢʜ ᴜᴘɪ , ɴᴇᴛ ʙᴀɴᴋɪɴɢ.

💳 ᴜᴘɪ ɪᴅ - <code>{}</code>

💢 ᴍᴜꜱᴛ ꜱᴇɴᴅ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.

‼️ ᴀꜰᴛᴇʀ ꜱᴇɴᴅɪɴɢ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴘʟᴇᴀꜱᴇ ɢɪᴠᴇ ᴜꜱ ꜱᴏᴍᴇᴛɪᴍᴇ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴘʀᴇᴍɪᴜᴍ ʟɪꜱᴛ.</b>"""


    PREMIUM_END_TEXT = """<b>ʜᴇʏ {},</b>

<b>ʏᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴄᴇss ʜᴀs ʙᴇᴇɴ ʀᴇᴍᴏᴠᴇᴅ.</b>  
<b>ᴛʜᴀɴᴋ ʏᴏᴜ ꜰᴏʀ ᴜsɪɴɢ ᴏᴜʀ sᴇʀᴠɪᴄᴇ 😊</b>  
<b>ᴄʟɪᴄᴋ ᴏɴ /plan ᴛᴏ ᴄʜᴇᴄᴋ ᴏᴜʀ ᴏᴛʜᴇʀ ᴘʟᴀɴs.</b>

<blockquote>ᴀᴀᴘᴋᴀ <b>ᴘʀᴇᴍɪᴜᴍ ᴀᴄᴄᴇss</b> ʜᴀᴛᴀ ᴅɪʏᴀ ɢᴀʏᴀ ʜᴀɪ।  
ʜᴀᴍᴀʀɪ sᴇᴠᴀ ᴋᴀ ᴜᴘʏᴏɢ ᴋᴀʀɴᴇ ᴋᴇ ʟɪʏᴇ ᴅʜᴀɴʏᴀᴠᴀᴀᴅ 🥳  
ʜᴀᴍᴀʀɪ ᴀɴʏᴀ ʏᴏᴊɴᴀᴏɴ ᴋɪ ᴊᴀᴀɴᴄʜ ᴋᴀʀɴᴇ ᴋᴇ ʟɪʏᴇ <b>/plan</b> ᴘᴀʀ ᴋʟɪᴄᴋ ᴋᴀʀᴇɪɴ।</blockquote>
"""

    
    BPREMIUM_TXT = """<b><blockquote>🎁 ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇs 🎁</blockquote></b>

<b>✨ ʙᴇɴᴇꜰɪᴛs ᴏꜰ ʙᴇɪɴɢ ᴀ ᴘʀᴇᴍɪᴜᴍ ᴍᴇᴍʙᴇʀ:</b>
⊛ <code>ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ ʟɪɴᴋs 🛑</code>
⊛ <code>ɢᴇᴛ ꜰɪʟᴇs ᴅɪʀᴇᴄᴛʟʏ ɪɴ PM 🚀</code>
⊛ <code>100% ᴀᴅ-ꜰʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ 🚫</code>
⊛ <code>ᴜɴʟɪᴍɪᴛᴇᴅ ᴍᴏᴠɪᴇs & sᴇʀɪᴇs 🍿</code>
⊛ <code>ʜɪɢʜ-sᴘᴇᴇᴅ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋs ⚡</code>
⊛ <code>ᴍᴜʟᴛɪ-ᴘʟᴀʏᴇʀ sᴛʀᴇᴀᴍɪɴɢ ʟɪɴᴋs 🎥</code>
⊛ <code>24/7 ꜰᴜʟʟ ᴀᴅᴍɪɴ sᴜᴘᴘᴏʀᴛ 📞</code>
⊛ <code>ʀᴇǫᴜᴇsᴛs ᴄᴏᴍᴘʟᴇᴛᴇᴅ ɪɴ 1 ʜᴏᴜʀ ✅</code>

<b>💡 ʜᴏᴡ ᴛᴏ ɢᴇᴛ ɪᴛ?</b>
ʏᴏᴜ ᴄᴀɴ ᴇɪᴛʜᴇʀ <b>ʀᴇꜰᴇʀ ʏᴏᴜʀ ꜰʀɪᴇɴᴅs</b> (ꜰʀᴇᴇ!) ᴏʀ <b>ʙᴜʏ ᴀ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴ</b> ʙʏ ᴄʟɪᴄᴋɪɴɢ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ. 👇

<b>◉ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴀᴄᴛɪᴠᴇ ᴘʟᴀɴ ➠ /myplan</b>"""  


    PREPLANS_TXT = """<b>👋 ʜᴇʏ {},

<blockquote>🎖️ <b>ᴏᴜʀ ᴘʀᴇᴍɪᴜᴍ ᴘʟᴀɴꜱ (ꜱᴀᴠᴇ ʙɪɢ!)</b></blockquote>

◉ 07 ᴅᴀʏꜱ - ₹20  (ᴛʀɪᴀʟ)
◉ 15 ᴅᴀʏꜱ - ₹40  
◉ 30 ᴅᴀʏꜱ - ₹80  (🤩 ᴘᴏᴘᴜʟᴀʀ - ꜱᴀᴠᴇ 15%)
◉ 45 ᴅᴀʏꜱ - ₹110 (🔥 ʙᴇꜱᴛ ᴠᴀʟᴜᴇ - ꜱᴀᴠᴇ 25%)
◉ 60 ᴅᴀʏꜱ - ₹130 (💎 ꜱᴜᴘᴇʀ ꜱᴀᴠᴇʀ - ꜱᴀᴠᴇ 35%)
◉ ʟɪꜰᴇᴛɪᴍᴇ - ₹1500 (♾️ ᴏɴᴇ ᴛɪᴍᴇ ᴘᴀʏᴍᴇɴᴛ!)

<blockquote>🌟 <b>20+ ᴜʟᴛɪᴍᴀᴛᴇ ᴘʀᴇᴍɪᴜᴍ ꜰᴇᴀᴛᴜʀᴇꜱ</b> 🌟</blockquote>
⊛ <code>🚫 100% ᴀᴅ-ꜰʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ</code>
⊛ <code>🚀 ɪɴꜱᴛᴀɴᴛ ᴅɪʀᴇᴄᴛ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋꜱ</code>
⊛ <code>⚡ ᴜʟᴛʀᴀ ʜɪɢʜ-ꜱᴘᴇᴇᴅ ꜱᴇʀᴠᴇʀꜱ</code>
⊛ <code>🛑 ɴᴏ ʟɪɴᴋ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ᴇᴠᴇʀ</code>
⊛ <code>🎥 4ᴋ & ʜᴅʀ ᴍᴏᴠɪᴇꜱ ꜱᴜᴘᴘᴏʀᴛ</code>
⊛ <code>🍿 ᴜɴʟɪᴍɪᴛᴇᴅ ᴍᴏᴠɪᴇꜱ & ꜱᴇʀɪᴇꜱ ᴀᴄᴄᴇꜱꜱ</code>
⊛ <code>▶️ ᴍᴜʟᴛɪ-ᴘʟᴀʏᴇʀ ꜱᴛʀᴇᴀᴍɪɴɢ (ᴠʟᴄ, ᴍx)</code>
⊛ <code>♾️ ᴜɴʟɪᴍɪᴛᴇᴅ ꜰɪʟᴇ ʀᴇQᴜᴇꜱᴛꜱ</code>
⊛ <code>✅ ʀᴇQᴜᴇꜱᴛꜱ ꜰᴜʟꜰɪʟʟᴇᴅ ᴡɪᴛʜɪɴ 1 ʜᴏᴜʀ</code>
⊛ <code>📥 ʙᴀᴛᴄʜ ᴅᴏᴡɴʟᴏᴀᴅ ꜱᴜᴘᴘᴏʀᴛ</code>
⊛ <code>⏰ ᴇᴀʀʟʏ ᴀᴄᴄᴇꜱꜱ ᴛᴏ ɴᴇᴡ ʀᴇʟᴇᴀꜱᴇꜱ</code>
⊛ <code>📡 ꜱᴜᴘᴇʀ ꜰᴀꜱᴛ ʙᴏᴛ ʀᴇꜱᴘᴏɴꜱᴇ (0.1ꜱ)</code>
⊛ <code>🎙️ ᴅᴜᴀʟ/ᴍᴜʟᴛɪ ᴀᴜᴅɪᴏ ꜰɪʟᴇꜱ ꜰɪʟᴛᴇʀ</code>
⊛ <code>🎬 ʜɪɢʜ ǫᴜᴀʟɪᴛʏ x265 / HEVC ꜰɪʟᴇꜱ</code>
⊛ <code>📺 ᴏᴛᴛ ᴄᴏɴᴛᴇɴᴛ (ɴᴇᴛꜰʟɪx, ᴘʀɪᴍᴇ, ᴇᴛᴄ.)</code>
⊛ <code>📱 ᴍᴏʙɪʟᴇ & ᴘᴄ ꜰʀɪᴇɴᴅʟʏ ʟɪɴᴋꜱ</code>
⊛ <code>🔗 ʀᴇꜱᴜᴍᴀʙʟᴇ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋꜱ</code>
⊛ <code>🌐 ɢʟᴏʙᴀʟ ᴄᴅɴ ꜰᴏʀ ᴢᴇʀᴏ ʙᴜꜰꜰᴇʀɪɴɢ</code>
⊛ <code>🛡️ 100% ꜱᴀꜰᴇ & ꜱᴇᴄᴜʀᴇ ꜰɪʟᴇꜱ</code>
⊛ <code>🎁 ꜱᴘᴇᴄɪᴀʟ ɢɪᴠᴇᴀᴡᴀʏꜱ ꜰᴏʀ ᴘʀᴇᴍɪᴜᴍ ᴜꜱᴇʀꜱ</code>
⊛ <code>📞 24/7 ᴠɪᴘ ᴀᴅᴍɪɴ ꜱᴜᴘᴘᴏʀᴛ</code>

•─────•─────────•─────•

🏷️ <b>ᴘᴀʏᴍᴇɴᴛ ᴍᴇᴛʜᴏᴅꜱ</b>
💸 ᴜᴘɪ ɪᴅ → <code>{}</code>  
📷 ǫʀ ᴄᴏᴅᴇ → <a href='{}'>ᴄʟɪᴄᴋ ʜᴇʀᴇ ᴛᴏ ꜱᴄᴀɴ</a>  

🧾 ᴘᴀʏ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ!

‼️ ᴍᴜꜱᴛ ꜱᴇɴᴅ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.  
‼️ ᴀꜰᴛᴇʀ ꜱᴇɴᴅɪɴɢ ᴀ ꜱᴄʀᴇᴇɴꜱʜᴏᴛ, ɢɪᴠᴇ ᴜꜱ ꜱᴏᴍᴇ ᴛɪᴍᴇ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴛʜᴇ ᴘʀᴇᴍɪᴜᴍ ʟɪꜱᴛ.

💎 ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴘʟᴀɴ → /myplan</b>"""


    FREE_TXT = """<b>👋 ʜᴇʏ {},
    
🎉 <u>ꜰʀᴇᴇ ᴛʀɪᴀʟ (1 ᴡᴇᴇᴋ)</u> 🎉
❗ ʏᴏᴜ ᴄᴀɴ ᴄʟᴀɪᴍ ᴛʜɪꜱ 1-ᴡᴇᴇᴋ ᴘʀᴇᴍɪᴜᴍ ᴛʀɪᴀʟ ᴏɴʟʏ ᴏɴᴄᴇ!
 
⊛ <code>🚫 100% ᴀᴅ-ꜰʀᴇᴇ ᴇxᴘᴇʀɪᴇɴᴄᴇ</code>
⊛ <code>🚀 ɪɴꜱᴛᴀɴᴛ ᴅɪʀᴇᴄᴛ ᴅᴏᴡɴʟᴏᴀᴅ ʟɪɴᴋꜱ</code>
⊛ <code>▶️ ᴍᴜʟᴛɪ-ᴘʟᴀʏᴇʀ ꜱᴛʀᴇᴀᴍɪɴɢ</code>
⊛ <code>⚡ ʜɪɢʜ-ꜱᴘᴇᴇᴅ ꜱᴇʀᴠᴇʀꜱ</code>

👨‍💻 ᴄʟɪᴄᴋ ᴛʜᴇ "ᴄʟᴀɪᴍ ᴛʀɪᴀʟ" ʙᴜᴛᴛᴏɴ ʙᴇʟᴏᴡ ᴛᴏ ɪɴꜱᴛᴀɴᴛʟʏ ᴀᴄᴛɪᴠᴀᴛᴇ ʏᴏᴜʀ ᴛʀɪᴀʟ!

➛ ᴜꜱᴇ /plan ᴛᴏ ꜱᴇᴇ ᴀʟʟ ᴏᴜʀ ᴘʟᴀɴꜱ ᴀᴛ ᴏɴᴄᴇ.
➛ ᴄʜᴇᴄᴋ ʏᴏᴜʀ ᴀᴄᴛɪᴠᴇ ᴘʟᴀɴ ʙʏ ᴜꜱɪɴɢ : /myplan</b>"""

    
    UPI_TXT = """<b>👋 ʜᴇʏ {},
    
 ᴘᴀʏ ᴀᴍᴍᴏᴜɴᴛ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ ᴍᴇᴍʙᴇʀꜱʜɪᴘ !

💵 ᴜᴘɪ ɪᴅ - <code>{}</code>

‼️ ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.</b>"""

    QR_TXT = """<b>👋 ʜᴇʏ {},
    
 ᴘᴀʏ ᴀᴍᴍᴏᴜɴᴛ ᴀᴄᴄᴏʀᴅɪɴɢ ᴛᴏ ʏᴏᴜʀ ᴘʟᴀɴ ᴀɴᴅ ᴇɴᴊᴏʏ ᴘʀᴇᴍɪᴜᴍ ᴍᴇᴍʙᴇʀꜱʜɪᴘ !

📸 ǫʀ ᴄᴏᴅᴇ - <a href='{}'>ᴄʟɪᴄᴋ ʜᴇʀᴇ ᴛᴏ ꜱᴄᴀɴ</a>

‼️ ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀғᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ.</b>"""

    SOURCE_TXT ="""<b>📝 ꜱᴏᴜʀᴄᴇ ᴄᴏᴅᴇ : 👇 </b>

<b>Hey there! 👋
This bot's source code is currently private. However, it may be released as an open-source project once we hit the 10,000 users milestone! 🚀

Feel free to use the bot directly or add it to your own groups to enjoy the automatic movie filtering! ❤️</b>"""

    SETTING_TXT = """    
<u>ꜱᴇᴛᴛɪɴɢꜱ</u> :
- ꜱᴇᴛᴛɪɴɢꜱ ɪꜱ ᴛʜᴇ ᴍᴏꜱᴛ ɪᴍᴘᴏʀᴛᴀɴᴛ ꜰᴇᴀᴛᴜʀᴇ ᴏꜰ ᴛʜɪꜱ ʙᴏᴛ.
- ʏᴏᴜ ᴄᴀɴ ᴇᴀꜱɪʟʏ ᴄᴜꜱᴛᴏᴍɪᴢᴇ ᴛʜɪꜱ ʙᴏᴛ ꜰᴏʀ ʏᴏᴜʀ ɢʀᴏᴜᴘ.

<u>ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</u> :
• /settings - ᴄʜᴀɴɢᴇ ᴛʜᴇ ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ ᴀꜱ ʏᴏᴜʀ ᴡɪꜱʜ.
• /set_shortner - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_tutorial - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_time - ꜱᴇᴛ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_time_2 - ꜱᴇᴛ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_log_channel - ꜱᴇᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ʟᴏɢ ᴄʜᴀɴɴᴇʟ.
• /set_fsub - ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /remove_fsub - ʀᴇᴍᴏᴠᴇ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /reset_group - ʀᴇꜱᴇᴛ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ.
• /details - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ."""
    
    VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},

📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ ᴛᴏᴅᴀʏ, ᴘʟᴇᴀꜱᴇ ᴄʟɪᴄᴋ ᴏɴ ᴠᴇʀɪꜰʏ & ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇꜱꜱ ꜰᴏʀ ᴛɪʟʟ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 1/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ).</i></b>"""
    

    VERIFY_COMPLETE_TEXT = """<b><i>👋 ʜᴇʏ {},

ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.</i></b>"""

    SECOND_VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},

📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ, ᴛᴀᴘ ᴏɴ ᴛʜᴇ ᴠᴇʀɪꜰʏ ʟɪɴᴋ ᴀɴᴅ ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ᴛɪʟʟ ɴᴇxᴛ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ.

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 2/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ).</i></b>"""

    SECOND_VERIFY_COMPLETE_TEXT = """<b><i>👋 ʜᴇʏ {},
    
ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ.</i></b>"""

    THIRDT_VERIFICATION_TEXT = """<b><i>👋 ʜᴇʏ {},
    
📌 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪꜰɪᴇᴅ, ᴛᴀᴘ ᴏɴ ᴛʜᴇ ᴠᴇʀɪꜰʏ ʟɪɴᴋ & ɢᴇᴛ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ꜰᴜʟʟ ᴅᴀʏ.</u>

#ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ:- 3/3 ✓

ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴅɪʀᴇᴄᴛ ꜰɪʟᴇs ᴛʜᴇɴ ʏᴏᴜ ᴄᴀɴ ᴛᴀᴋᴇ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴠɪᴄᴇ (ɴᴏ ɴᴇᴇᴅ ᴛᴏ ᴠᴇʀɪꜰʏ)</i></b>"""

    THIRDT_VERIFY_COMPLETE_TEXT= """<b><i>👋 ʜᴇʏ {},
    
ʏᴏᴜ ʜᴀᴠᴇ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜᴇ 3ʀᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ✓

ɴᴏᴡ ʏᴏᴜ ʜᴀᴠᴇ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss ꜰᴏʀ ɴᴇxᴛ ꜰᴜʟʟ ᴅᴀʏ.</i></b>"""

    VERIFIED_LOG_TEXT = """ᴜꜱᴇʀ ᴠᴇʀɪꜰɪᴇᴅ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ ✓

👤 ɴᴀᴍᴇ:- {} [ <code>{}</code> ]

📆 ᴅᴀᴛᴇ:- <code>{} </code>

#Verificaton_{}_Completed"""


    ADMIN_CMD = """<b>🌟 <u>ᴀᴅᴠᴀɴᴄᴇᴅ ᴀᴅᴍɪɴ ᴄᴏɴᴛʀᴏʟ ᴘᴀɴᴇʟ</u> 🌟</b>

<b>👋 ʜᴇʟʟᴏ ᴀᴅᴍɪɴ! ʜᴇʀᴇ ɪꜱ ʏᴏᴜʀ ᴘᴏᴡᴇʀꜰᴜʟ ᴄᴏᴍᴍᴀɴᴅ ʟɪꜱᴛ ᴛᴏ ᴍᴀɴᴀɢᴇ ᴛʜɪꜱ ʙᴏᴛ :</b>

<blockquote><b>📊 ꜱᴛᴀᴛɪꜱᴛɪᴄꜱ & ᴏᴠᴇʀᴠɪᴇᴡ</b></blockquote>
• /stats - <code>Gᴇᴛ Dᴇᴛᴀɪʟᴇᴅ Mᴜʟᴛɪ-DB Sᴛᴀᴛs, Uꜱᴇʀꜱ & Cʜᴀᴛꜱ</code>
• /logs - <code>Gᴇᴛ Tʜᴇ Rᴇᴄᴇɴᴛ Eʀʀᴏʀ Lᴏɢꜱ</code>
• /users - <code>Gᴇᴛ Lɪꜱᴛ Oꜰ ᴀʟʟ Mʏ Uꜱᴇʀꜱ Iᴅꜱ</code>
• /chats - <code>Gᴇᴛ Lɪꜱᴛ Oꜰ ᴀʟʟ Cᴏɴɴᴇᴄᴛᴇᴅ Cʜᴀᴛꜱ Iᴅꜱ</code>

<blockquote><b>🛡️ ɢʀᴏᴜᴘ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ & ᴄᴏɴᴛʀᴏʟꜱ (ɴᴇᴡ ᴘᴀɴᴇʟꜱ)</b></blockquote>
• /glist - <code>Sʜᴏᴡ ᴀʟʟ ɢʀᴏᴜᴘꜱ ᴡɪᴛʜ ᴛʜᴇɪʀ Iɴʟɪɴᴇ Cᴏɴᴛʀᴏʟ Pᴀɴᴇʟꜱ</code>
• /gall - <code>Rᴀᴡ Lɪꜱᴛ Oꜰ Aʟʟ Cᴏɴɴᴇᴄᴛᴇᴅ Gʀᴏᴜᴘꜱ</code>
• /ginfo [chat_id] - <code>Oᴘᴇɴ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ɢʀᴏᴜᴘ'ꜱ Cᴏɴᴛʀᴏʟ Pᴀɴᴇʟ</code>
• /gverify [chat_id] - <code>Tᴏɢɢʟᴇ ᴠᴇʀɪꜰʏ/ꜱʜᴏʀᴛɴᴇʀ ɪɴ ᴀɴʏ ɢʀᴏᴜᴘ ɪɴꜱᴛᴀɴᴛʟʏ</code>
• /gban [chat_id] - <code>Bᴀɴ ᴀ ɢʀᴏᴜᴘ (Bᴏᴛ ᴡᴏɴ'ᴛ ᴡᴏʀᴋ ᴛʜᴇʀᴇ)</code>
• /gunban [chat_id] - <code>Uɴʙᴀɴ ᴀ ᴘʀᴇᴠɪᴏᴜꜱʟʏ ʙᴀɴɴᴇᴅ ɢʀᴏᴜᴘ</code>
• /gleave [chat_id] - <code>Fᴏʀᴄᴇ ᴛʜᴇ ʙᴏᴛ ᴛᴏ ʟᴇᴀᴠᴇ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ɢʀᴏᴜᴘ</code>
• /greset [chat_id] - <code>Rᴇꜱᴇᴛ ᴀʟʟ ꜱᴇᴛᴛɪɴɢꜱ ꜰᴏʀ ᴀ ɢʀᴏᴜᴘ</code>

<blockquote><b>💬 ʙʀᴏᴀᴅᴄᴀꜱᴛ & ᴍᴇꜱꜱᴀɢɪɴɢ</b></blockquote>
• /broadcast - <code>Sᴇɴᴅ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ Uꜱᴇʀꜱ</code>
• /grp_broadcast - <code>Sᴇɴᴅ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ Gʀᴏᴜᴘꜱ</code>
• /send [user_id] - <code>Sᴇɴᴅ PM Dɪʀᴇᴄᴛʟʏ ᴛᴏ ᴀ Uꜱᴇʀ</code>

<blockquote><b>👑 ᴘʀᴇᴍɪᴜᴍ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ</b></blockquote>
• /add_premium - <code>Aᴅᴅ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ᴜꜱᴇʀ ᴛᴏ Pʀᴇᴍɪᴜᴍ ʟɪꜱᴛ</code>
• /remove_premium - <code>Rᴇᴍᴏᴠᴇ ᴀ ᴜꜱᴇʀ ꜰʀᴏᴍ Pʀᴇᴍɪᴜᴍ</code>
• /premium_users - <code>Sᴇᴇ ᴛʜᴇ ʟɪꜱᴛ ᴏꜰ ᴀʟʟ Pʀᴇᴍɪᴜᴍ ᴜꜱᴇʀꜱ</code>
• /get_premium - <code>Cʜᴇᴄᴋ ᴀ ᴜꜱᴇʀ'ꜱ Pʀᴇᴍɪᴜᴍ ꜱᴛᴀᴛᴜꜱ</code>

<blockquote><b>⚡ ʙᴏᴛ ᴛᴏɢɢʟᴇꜱ & ꜱᴇᴛᴛɪɴɢꜱ</b></blockquote>
• /movie_update - <code>Oɴ/Oꜰꜰ Nᴇᴡ Fɪʟᴇ Mᴏᴠɪᴇ Aʟᴇʀᴛꜱ</code> 
• /pm_search - <code>Oɴ/Oꜰꜰ Dɪʀᴇᴄᴛ Bᴏᴛ PM Sᴇᴀʀᴄʜ</code>
• /del_msg - <code>Oɴ/Oꜰꜰ Fɪʟᴇ Nᴀᴍᴇ Dᴇʟᴇᴛɪᴏɴ Nᴏᴛɪꜰɪᴄᴀᴛɪᴏɴꜱ</code>

<blockquote><b>❌ ᴍᴏᴅᴇʀᴀᴛɪᴏɴ & ꜱʏꜱᴛᴇᴍ</b></blockquote>
• /ban [user_id] - <code>Bᴀɴ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ᴜꜱᴇʀ ꜰʀᴏᴍ ʙᴏᴛ</code>
• /unban [user_id] - <code>Uɴʙᴀɴ ᴀ ꜱᴘᴇᴄɪꜰɪᴄ ᴜꜱᴇʀ</code>
• /deletefiles - <code>Dᴇʟᴇᴛᴇ CᴀᴍRɪᴘ ᴀɴᴅ PʀᴇDVD Mᴀꜱꜱ Fɪʟᴇꜱ Pᴜʀɢᴇ</code>
• /delete - <code>Dᴇʟᴇᴛᴇ ᴀ Sᴘᴇᴄɪꜰɪᴄ Fɪʟᴇ Uꜱɪɴɢ Mᴏɴɢᴏ ID</code>
• /index_stats - <code>Cʜᴇᴄᴋ ᴀᴄᴛɪᴠᴇ ɪɴᴅᴇxɪɴɢ ᴊᴏʙ sᴛᴀᴛs</code>
• /stop_indexing - <code>Sᴛᴏᴘ ʀᴜɴɴɪɴɢ ɪɴᴅᴇxɪɴɢ ᴊᴏʙ</code>
• /restart - <code>Rᴇꜱᴛᴀʀᴛ ᴛʜᴇ Eɴᴛɪʀᴇ Sʏꜱᴛᴇᴍ Sᴀꜰᴇʟʏ</code>
• /deleteall - <code>Dᴇʟᴇᴛᴇ ᴀʟʟ ꜰɪʟᴇꜱ ꜰʀᴏᴍ ᴛʜᴇ ᴅᴀᴛᴀʙᴀꜱᴇ</code>
• /global_shortener - <code>Tᴏɢɢʟᴇ ɢʟᴏʙᴀʟ ꜱʜᴏʀᴛᴇɴᴇʀ</code>
• /auto_index - <code>Tᴏɢɢʟᴇ ᴀᴜᴛᴏ ɪɴᴅᴇxɪɴɢ</code>"""



    GROUP_CMD = """ʜᴇʏ 👋,
📚 ʜᴇʀᴇ ᴀʀᴇ ᴍʏ ᴄᴏᴍᴍᴀɴᴅꜱ ʟɪꜱᴛ ꜰᴏʀ ᴄᴜꜱᴛᴏᴍɪᴢᴇᴅ ɢʀᴏᴜᴘꜱ ⇊

• /settings - ᴄʜᴀɴɢᴇ ᴛʜᴇ ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ ᴀꜱ ʏᴏᴜʀ ᴡɪꜱʜ.
• /set_shortner - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_shortner_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ꜱʜᴏʀᴛɴᴇʀ.
• /set_tutorial - ꜱᴇᴛ ʏᴏᴜʀ 1ꜱᴛ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_2 - ꜱᴇᴛ ʏᴏᴜʀ 2ɴᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_tutorial_3 - ꜱᴇᴛ ʏᴏᴜʀ 3ʀᴅ ᴛᴜᴛᴏʀɪᴀʟ ᴠɪᴅᴇᴏ .
• /set_time - ꜱᴇᴛ 1ꜱᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_time_2 - ꜱᴇᴛ 2ɴᴅ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ɢᴀᴘ.
• /set_log_channel - ꜱᴇᴛ ᴠᴇʀɪꜰɪᴄᴀᴛɪᴏɴ ʟᴏɢ ᴄʜᴀɴɴᴇʟ.
• /set_fsub - ꜱᴇᴛ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /remove_fsub - ʀᴇᴍᴏᴠᴇ ᴄᴜꜱᴛᴏᴍ ꜰᴏʀᴄᴇ ꜱᴜʙ ᴄʜᴀɴɴᴇʟ.
• /reset_group - ʀᴇꜱᴇᴛ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ.
• /details - ᴄʜᴇᴄᴋ ʏᴏᴜʀ ꜱᴇᴛᴛɪɴɢꜱ."""    



    
